results/raw/llama-3-3-70b-instruct/gpu_2x_pro_6000_blackwell/20260716T145431Z/vllm-c32.txt
+ sudo docker exec vllm-bench vllm bench serve --base-url http://127.0.0.1:8000 --backend openai --endpoint /v1/completions --model unsloth/Llama-3.3-70B-Instruct --dataset-name random --random-input-len 128 --random-output-len 128 --num-prompts 160 --max-concurrency 32 --request-rate inf --save-result --result-dir /tmp --result-filename vllm-c32.json
<frozen importlib._bootstrap_external>:1301: FutureWarning: The cuda.cudart module is deprecated and will be removed in a future release, please switch to use the cuda.bindings.runtime module instead.
<frozen importlib._bootstrap_external>:1301: FutureWarning: The cuda.nvrtc module is deprecated and will be removed in a future release, please switch to use the cuda.bindings.nvrtc module instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x70bbc1341440>, trust_remote_code=False, seed=0, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=128, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=32, model='unsloth/Llama-3.3-70B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/tmp', result_filename='vllm-c32.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-a0370a2b-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-16 15:16:13 [utils.py:90] Sampling input_len from [127, 127] and output_len from [128, 128]
[transformers] Ignoring clean_up_tokenization_spaces=True for BPE tokenizer CachedTokenizersBackend. The clean_up_tokenization post-processing step is designed for WordPiece tokenizers and is destructive for BPE (it strips spaces before punctuation). Set clean_up_tokenization_spaces=False to suppress this warning, or set clean_up_tokenization_spaces_for_bpe_even_though_it_will_corrupt_output=True to force cleanup anyway.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 160/160 [00:44<00:00,  3.61it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Failed requests:                         0         
Maximum request concurrency:             32        
Benchmark duration (s):                  44.34     
Total input tokens:                      20480     
Total generated tokens:                  20480     
Request throughput (req/s):              3.61      
Output token throughput (tok/s):         461.84    
Peak output token throughput (tok/s):    544.00    
Peak concurrent requests:                64.00     
Total token throughput (tok/s):          923.68    
---------------Time to First Token----------------
Mean TTFT (ms):                          978.77    
Median TTFT (ms):                        1244.11   
P99 TTFT (ms):                           1253.00   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          62.11     
Median TPOT (ms):                        62.06     
P99 TPOT (ms):                           70.26     
---------------Inter-token Latency----------------
Mean ITL (ms):                           62.11     
Median ITL (ms):                         62.11     
P99 ITL (ms):                            63.45     
==================================================
+ sudo docker cp vllm-bench:/tmp/vllm-c32.json /tmp/vllm-c32.json
+ cat /tmp/vllm-c32.json
{"date": "20260716-151658", "endpoint_type": "openai", "backend": "openai", "label": null, "model_id": "unsloth/Llama-3.3-70B-Instruct", "tokenizer_id": "unsloth/Llama-3.3-70B-Instruct", "num_prompts": 160, "request_rate": "inf", "burstiness": 1.0, "max_concurrency": 32, "duration": 44.34459694999987, "completed": 160, "failed": 0, "total_input_tokens": 20480, "total_output_tokens": 20480, "request_throughput": 3.608105857414958, "request_goodput": null, "output_throughput": 461.8375497491146, "total_token_throughput": 923.6750994982292, "max_output_tokens_per_s": 544.0, "max_concurrent_requests": 64, "rtfx": 0.0, "mean_ttft_ms": 978.7700041312604, "median_ttft_ms": 1244.114767499923, "std_ttft_ms": 390.7637041782443, "p99_ttft_ms": 1253.0032264803049, "mean_tpot_ms": 62.1087971149605, "median_tpot_ms": 62.06132828346536, "std_tpot_ms": 1.290826543401585, "p99_tpot_ms": 70.26105541992223, "mean_itl_ms": 62.108798083464535, "median_itl_ms": 62.10664599984739, "std_itl_ms": 14.16497762956483, "p99_itl_ms": 63.44632629001354}VLLM_BENCH_DONE
+ echo VLLM_BENCH_DONE